# query the sum of the populations of all cities where the CONTINENT is 'Asia'.

Given the CITY and COUNTRY tables, query the sum of the populations of all cities where the CONTINENT is 'Asia'.

In [ ]:
select sum(city.population) from city
inner join country
on country.Code = city.countrycode
where country.CONTINENT = 'Asia'

```
ERROR 1052 (23000) at line 1: Column 'population' in field list is ambiguous
```
이건 population 이 두 테이블에서 모두 있으니 발생함. 그래서 population -> city.population

https://clairdelunes.tistory.com/22

SQ은 명시적 조인 표현(join 키워드)과 암시적 조인 표현(FROM 에서 `,`)으로 구분을 지정한다.

# query the names of all cities where the CONTINENT is 'Africa'.

Given the CITY and COUNTRY tables, query the names of all cities where the CONTINENT is 'Africa'.

Note: CITY.CountryCode and COUNTRY.Code are matching key columns.

Input Format

The CITY and COUNTRY tables are described as follows:

In [ ]:
select city.name from city
inner join country
on CITY.CountryCode =  COUNTRY.Code
where COUNTRY.CONTINENT = 'Africa'

```
여기서 드는 의문점 : df merge랑 sql join이랑 다른점은??
```
같은것으로 보인다. df merge how의 기본이 `key` 인것만 빼면.

# Average Population of Each Continent

Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer.

Note: CITY.CountryCode and COUNTRY.Code are matching key columns.

기대결과
```
Oceania 109189 
South America 147435 
Europe 175138 
Africa 274439 
Asia 693038 
```

In [ ]:
select COUNTRY.Continent, Floor(AVG(CITY.Population)) from city
inner join country
on CITY.CountryCode = COUNTRY.Code
group by COUNTRY.Continent

1st try ====================
```
select COUNTRY.Continent, round((CITY.Population),1) from city
inner join country
on CITY.CountryCode = COUNTRY.Code
```
결과
```
Asia 127800
Oceania 92273
Oceania 109914
Asia 127815
Asia 1392860
```
2nd Try
```
select COUNTRY.Continent, round((CITY.Population),1) from city
inner join country
on CITY.CountryCode = COUNTRY.Code
group_by COUNTRY.Continent
```
Error
```
check right syntax to use near 
'groub_by COUNTRY.Continent' at line 4
```
Changed
```
group_by -> group by
```

Group by 복습
```
GROUP BY를 사용할 때는 두가지를 기억해야 합니다.

특정 컬럼을 그룹화 하는 GROUP BY 

특정 컬럼을 그룹화한 결과에 조건을 거는 HAVING
```
https://extbrain.tistory.com/56

avg를 적용하기 위해선 

group_by COUNTRY.Continent 를 해야한다

# The Report

Ketty gives Eve a task to generate a report containing three columns: Name, Grade and Mark. Ketty doesn't want the NAMES of those students who received a grade lower than 8. The report must be in descending order by grade -- i.e. higher grades are entered first. If there is more than one student with the same grade (8-10) assigned to them, order those particular students by their name alphabetically. Finally, if the grade is lower than 8, use "NULL" as their name and list them by their grades in descending order. If there is more than one student with the same grade (1-7) assigned to them, order those particular students by their marks in ascending order.

Write a query to help Eve.

In [ ]:
# 다른 유저의 정답
SELECT IF(GRADE < 8, NULL, NAME), GRADE, MARKS
FROM STUDENTS JOIN GRADES
WHERE MARKS BETWEEN MIN_MARK AND MAX_MARK
ORDER BY GRADE DESC, NAME

# SELECT * FROM multiple tables -> 신기하네...

궁금증. Join & inner join 차이는?
```
They are functionally equivalent, 
but INNER JOIN can be a bit clearer to read
```
https://stackoverflow.com/questions/565620/difference-between-join-and-inner-join

궁금증. `ON` 없이 어떤 기준으로 조인되나?
```
It will match each row from table_a to every row in table_b. 
It’s similar to run SELECT * FROM multiple tables statement below.

Let’s say we have one table with 100 rows, 
another table with 200 rows, 
by running the statement above, 
we get a result of 20,000 rows!
```
pd.concat 에서 index가 다를 경우 Nan으로 채워지며 행이 뻥튀기되는거랑 비슷한것 같다. 다만 여기선 Nan이 아니라 두 테이블 조합의 모든 경우의 수로 뻥튀기 되는것으로 이해된다.
 
https://tableplus.com/blog/2019/09/sql-join-without-on.html

```
SELECT IF(GRADE < 8, NULL, NAME), GRADE, MARKS
FROM STUDENTS JOIN GRADES
```
이 쿼리 결과를 보자.
```
Samantha 10 87
Samantha 9 87
Samantha 8 87
NULL 7 87
NULL 6 87
...
```
다른 유저의 경우, SELECT * FROM multiple tables 의 동작 특징을 활용한 것으로 보인다.

# Ollivander's Inventory [join,group by,having]

Harry Potter and his friends are at Ollivander's with Ron, finally replacing Charlie's old broken wand.

Hermione decides the best way to choose is by determining the minimum number of gold galleons needed to buy each non-evil wand of high power and age. **Write a query to print the id, age, coins_needed, and power of the wands that Ron's interested in**, sorted in order of descending power. If more than one wand has same power, sort the result in order of descending age.

In [ ]:
SELECT id, age, coins_needed, power
FROM WANDS_PROPERTY JOIN WANDS on WANDS.code = WANDS_property.code
where WANDS_property.is_evil is not 0
order by power desc, age desc

# GG 왜 다른거지?
# by determining the minimum number of gold galleons needed 
# to buy each non-evil wand of high power and age
# 다른 정답자 의견
# we have to produce only those rows which have minimum_need for each age
# 아하..그렇다면 age 별로 minimum 비용인 것들만 하나의 행으로 리턴해야겠네

# [MY_SQL] where절과 having절의 차이 
# https://delirussum.tistory.com/141

기대값
```
1038 496 4789 10 
1130 494 9439 10 
1315 492 4126 10 
9 491 7345 10 
858 483 4352 10 
...
```
내결과 (기대값은 power 중복이면 age가 어린놈은 제외하라는 뜻인것같다 )
```
SELECT id, age, coins_needed, power
FROM WANDS_PROPERTY JOIN WANDS on WANDS.code = WANDS_property.code
where WANDS_property.is_evil is not 0
order by power desc, age desc

===

1303 496 6678 10 
1038 496 4789 10 
1130 494 9439 10 
1315 492 4126 10 
892 492 4345 10 
9 491 7345 10 
...
```

In [ ]:
# 다른 유저들의 답
SELECT id, age, coins_needed, power
FROM WANDS_PROPERTY JOIN WANDS on WANDS.code = WANDS_property.code
WHERE is_evil = 0
GROUP BY  age, power 
HAVING MIN(coins_needed) 
ORDER BY power DESC, age DESC;